foodtracker_app_api/app/controllers/foods_controller.rb

SELECT "foods".* FROM "foods"
---
    def index
        render json: {status: 200, foods: Food.all}

SELECT "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
    def show
        puts params
        food = Food.find(params[:id])

INSERT INTO "foods" ("prod_id", "item", "quantity", "pic", "days_expiration", "location", "nutrifacts") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["prod_id", 5], ["item", "apple"], ["quantity", 3], ["pic", "\\u{1F34F}"], ["days_expiration", 3], ["location", "fridge"], ["nutrifacts", "fruit"]]
---
    def create
        food = Food.new(food_params)

        if food.save

SELECT "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "foods" SET "prod_id" = $1, "item" = $2, "quantity" = $3, "pic" = $4, "days_expiration" = $5, "location" = $6, "nutrifacts" = $7 WHERE "foods"."id" = $8  [["prod_id", 8], ["item", "apple"], ["quantity", 3], ["pic", "🍎"], ["days_expiration", 3], ["location", "fridge"], ["nutrifacts", "fruit"], ["id", 3]]
---
    def update
        food = Food.find(params[:id])
        food.update(food_params)

DELETE FROM "foods" WHERE "foods"."id" = $1  [["id", 10]]
---
    def destroy
        song = Food.destroy(params[:id])